Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCif_regdef.h
/** \brief ISP Output Window Vertical Offset Shadow Register */
typedef struct _Ifx_CIF_ISP_OUT_V_OFFS_SHD_Bits
{
    Ifx_Strict_32Bit ISP_OUT_V_OFFS_SHD:12;    /**< \brief [11:0] Current vertical picture offset - ISP_OUT_V_OFFS_SHD (r) */
    Ifx_Strict_32Bit reserved_12:20;    /**< \brief [31:12] \internal Reserved */
} Ifx_CIF_ISP_OUT_V_OFFS_SHD_Bits;

/** \brief ISP Output Vertical Picture Size Register */
typedef struct _Ifx_CIF_ISP_OUT_V_SIZE_Bits
{
    Ifx_Strict_32Bit ISP_OUT_V_SIZE:12;    /**< \brief [11:0] Vertical picture size - ISP_OUT_V_SIZE (rw) */
    Ifx_Strict_32Bit reserved_12:20;    /**< \brief [31:12] \internal Reserved */
} Ifx_CIF_ISP_OUT_V_SIZE_Bits;

/** \brief ISP Output Vertical Picture Size Shadow Register */
typedef struct _Ifx_CIF_ISP_OUT_V_SIZE_SHD_Bits
{
    Ifx_Strict_32Bit ISP_OUT_V_SIZE_SHD:12;    /**< \brief [11:0] Current vertical pic size - ISP_OUT_V_SIZE_SHD (r) */
    Ifx_Strict_32Bit reserved_12:20;    /**< \brief [31:12] \internal Reserved */
} Ifx_CIF_ISP_OUT_V_SIZE_SHD_Bits;

/** \brief ISP Raw Interrupt Status Register */
typedef struct _Ifx_CIF_ISP_RIS_Bits
{
    Ifx_Strict_32Bit RIS_ISP_OFF:1;     /**< \brief [0:0] Isp was Turned Off (vsynced) - RIS_ISP_OFF (r) */
    Ifx_Strict_32Bit RIS_FRAME:1;       /**< \brief [1:1] Frame was Completely Put Out - RIS_FRAME (r) */
    Ifx_Strict_32Bit RIS_DATA_LOSS:1;    /**< \brief [2:2] Loss of Data - RIS_DATA_LOSS (r) */
    Ifx_Strict_32Bit RIS_PIC_SIZE_ERR:1;    /**< \brief [3:3] Pic Size Violation Occurred - RIS_PIC_SIZE_ERR (r) */
    Ifx_Strict_32Bit reserved_4:1;      /**< \brief [4:4] \internal Reserved */
    Ifx_Strict_32Bit RIS_FRAME_IN:1;    /**< \brief [5:5] Sampled Input Frame is Complete - RIS_FRAME_IN (r) */
    Ifx_Strict_32Bit RIS_V_START:1;     /**< \brief [6:6] Start Edge of v_sync - RIS_V_START (r) */
    Ifx_Strict_32Bit RIS_H_START:1;     /**< \brief [7:7] Start Edge of h_sync - RIS_H_START (r) */
    Ifx_Strict_32Bit reserved_8:11;     /**< \brief [18:8] \internal Reserved */
    Ifx_Strict_32Bit RIS_WD_TRIG:1;     /**< \brief [19:19] A watchdog timeout was triggered at the ISP input - RIS_WD_TRIG (r) */
    Ifx_Strict_32Bit reserved_20:12;    /**< \brief [31:20] \internal Reserved */
} Ifx_CIF_ISP_RIS_Bits;

/** \brief JPE Huffman Table Selector For AC Values Register */
typedef struct _Ifx_CIF_JPE_AC_TABLE_SELECT_Bits
{
    Ifx_Strict_32Bit AC_TABLE_SELECT:3;    /**< \brief [2:0] AC Table Selector - AC_TABLE_SELECT (rw) */
    Ifx_Strict_32Bit reserved_3:29;     /**< \brief [31:3] \internal Reserved */
} Ifx_CIF_JPE_AC_TABLE_SELECT_Bits;

/** \brief JPE Cb/Cr Value Scaling Control Register */
typedef struct _Ifx_CIF_JPE_CBCR_SCALE_EN_Bits
{
    Ifx_Strict_32Bit CBCR_SCALE_EN:1;    /**< \brief [0:0] Cb/Cr scale flag - CBCR_SCALE_EN (rw) */
    Ifx_Strict_32Bit reserved_1:31;     /**< \brief [31:1] \internal Reserved */
} Ifx_CIF_JPE_CBCR_SCALE_EN_Bits;

/** \brief JPE Huffman Table Selector For DC Values Register */
typedef struct _Ifx_CIF_JPE_DC_TABLE_SELECT_Bits
{
    Ifx_Strict_32Bit S0:1;              /**< \brief [0:0] DC Table Selector - S0 (rw) */
    Ifx_Strict_32Bit S1:1;              /**< \brief [1:1] DC Table Selector - S1 (rw) */
    Ifx_Strict_32Bit S2:1;              /**< \brief [2:2] DC Table Selector - S2 (rw) */
    Ifx_Strict_32Bit reserved_3:29;     /**< \brief [31:3] \internal Reserved */
} Ifx_CIF_JPE_DC_TABLE_SELECT_Bits;

/** \brief JPE Debug Information Register */
typedef struct _Ifx_CIF_JPE_DEBUG_Bits
{
    Ifx_Strict_32Bit reserved_0:2;      /**< \brief [1:0] \internal Reserved */
    Ifx_Strict_32Bit DEB_QIQ_TABLE_ACC:1;    /**< \brief [2:2] QIQ Table Access - DEB_QIQ_TABLE_ACC (r) */
    Ifx_Strict_32Bit DEB_VLC_ENCODE_BUSY:1;    /**< \brief [3:3] VLC Encode Busy - DEB_VLC_ENCODE_BUSY (r) */
    Ifx_Strict_32Bit DEB_R2B_MEMORY_FULL:1;    /**< \brief [4:4] R2B Memory Full - DEB_R2B_MEMORY_FULL (r) */
    Ifx_Strict_32Bit DEB_VLC_TABLE_BUSY:1;    /**< \brief [5:5] Debug VLC Table Busy - DEB_VLC_TABLE_BUSY (r) */
    Ifx_Strict_32Bit reserved_6:2;      /**< \brief [7:6] \internal Reserved */
    Ifx_Strict_32Bit DEB_BAD_TABLE_ACCESS:1;    /**< \brief [8:8] Debug Bad Table Access - DEB_BAD_TABLE_ACCESS (r) */
    Ifx_Strict_32Bit reserved_9:23;     /**< \brief [31:9] \internal Reserved */
} Ifx_CIF_JPE_DEBUG_Bits;

/** \brief JPE Start Command To Start JFIF Stream Encoding Register */
typedef struct _Ifx_CIF_JPE_ENCODE_Bits
{
    Ifx_Strict_32Bit ENCODE:1;          /**< \brief [0:0] Encode - ENCODE (w) */
    Ifx_Strict_32Bit reserved_1:3;      /**< \brief [3:1] \internal Reserved */
    Ifx_Strict_32Bit CONT_MODE:2;       /**< \brief [5:4] Encoder continuous mode - CONT_MODE (rw) */
    Ifx_Strict_32Bit reserved_6:26;     /**< \brief [31:6] \internal Reserved */
} Ifx_CIF_JPE_ENCODE_Bits;

/** \brief JPE Encoder Status Flag Register */
typedef struct _Ifx_CIF_JPE_ENCODER_BUSY_Bits
{
    Ifx_Strict_32Bit CODEC_BUSY:1;      /**< \brief [0:0] Codec Busy - CODEC_BUSY (r) */
    Ifx_Strict_32Bit reserved_1:31;     /**< \brief [31:1] \internal Reserved */
} Ifx_CIF_JPE_ENCODER_BUSY_Bits;

/** \brief JPE Encode Mode Register */
typedef struct _Ifx_CIF_JPE_ENCODE_MODE_Bits
{
    Ifx_Strict_32Bit ENCODE_MODE:1;     /**< \brief [0:0] Encode Mode - ENCODE_MODE (r) */
    Ifx_Strict_32Bit reserved_1:31;     /**< \brief [31:1] \internal Reserved */
} Ifx_CIF_JPE_ENCODE_MODE_Bits;

/** \brief JPEG Codec Horizontal Image Size For Encoding Register */
typedef struct _Ifx_CIF_JPE_ENC_HSIZE_Bits
{
    Ifx_Strict_32Bit ENC_HSIZE:12;      /**< \brief [11:0] Horizontal Size - ENC_HSIZE (rw) */
    Ifx_Strict_32Bit reserved_12:20;    /**< \brief [31:12] \internal Reserved */
} Ifx_CIF_JPE_ENC_HSIZE_Bits;

/** \brief JPEG Codec Vertical Image Size For Encoding Register */
typedef struct _Ifx_CIF_JPE_ENC_VSIZE_Bits
{
    Ifx_Strict_32Bit ENC_VSIZE:12;      /**< \brief [11:0] Vertical Size - ENC_VSIZE (rw) */
    Ifx_Strict_32Bit reserved_12:20;    /**< \brief [31:12] \internal Reserved */
} Ifx_CIF_JPE_ENC_VSIZE_Bits;

