Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCif_regdef.h
/** \brief Memory Interface Extra Path ${j} Control Internal Shadow Register */
typedef struct _Ifx_CIF_MIEP_CH_1S_CTRL_SHD_Bits
{
    Ifx_Strict_32Bit EP_ENABLE_IN:1;    /**< \brief [0:0] Extra Path In Enable - EP_ENABLE_IN (r) */
    Ifx_Strict_32Bit reserved_1:15;     /**< \brief [15:1] \internal Reserved */
    Ifx_Strict_32Bit EP_ENABLE_OUT:1;    /**< \brief [16:16] Extra Path Out Enable - EP_ENABLE_OUT (r) */
    Ifx_Strict_32Bit reserved_17:15;    /**< \brief [31:17] \internal Reserved */
} Ifx_CIF_MIEP_CH_1S_CTRL_SHD_Bits;

/** \brief Memory Interface Extra Path ${j} Control Register For Address Init And Skip Function Register */
typedef struct _Ifx_CIF_MIEP_CH_1S_INIT_Bits
{
    Ifx_Strict_32Bit reserved_0:2;      /**< \brief [1:0] \internal Reserved */
    Ifx_Strict_32Bit MI_EP_SKIP:1;      /**< \brief [2:2] Skip Picture - MI_EP_SKIP (w) */
    Ifx_Strict_32Bit reserved_3:1;      /**< \brief [3:3] \internal Reserved */
    Ifx_Strict_32Bit MI_EP_CFG_UPD:1;    /**< \brief [4:4] Forced Configuration Update - MI_EP_CFG_UPD (w) */
    Ifx_Strict_32Bit reserved_5:27;     /**< \brief [31:5] \internal Reserved */
} Ifx_CIF_MIEP_CH_1S_INIT_Bits;

/** \brief Memory Interface Fill Level Interrupt Offset Value For Extra Path Data Register */
typedef struct _Ifx_CIF_MIEP_CH_1S_IRQ_OFFS_INIT_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;     /**< \brief [1:0] Bits [1:0] are set to “00” (word aligned value). - FIXED_TO_00 (r) */
    Ifx_Strict_32Bit EP_IRQ_OFFS_INIT:22;    /**< \brief [23:2] Extra Path Y IRQ Offset Init - EP_IRQ_OFFS_INIT (rw) */
    Ifx_Strict_32Bit reserved_24:8;     /**< \brief [31:24] \internal Reserved */
} Ifx_CIF_MIEP_CH_1S_IRQ_OFFS_INIT_Bits;

/** \brief Memory Interface Shadow Register of Fill Level Interrupt Offset Value For Extra Path ${j} Register */
typedef struct _Ifx_CIF_MIEP_CH_1S_IRQ_OFFS_SHD_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;     /**< \brief [1:0] Bits [1:0] are set to “00” (word aligned value). - FIXED_TO_00 (r) */
    Ifx_Strict_32Bit EP_IRQ_OFFS:22;    /**< \brief [23:2] Extra Path IRQ Offset - EP_IRQ_OFFS (r) */
    Ifx_Strict_32Bit reserved_24:8;     /**< \brief [31:24] \internal Reserved */
} Ifx_CIF_MIEP_CH_1S_IRQ_OFFS_SHD_Bits;

/** \brief Memory Interface Offset Counter Init Value For Extra Path ${j} Buffer Register */
typedef struct _Ifx_CIF_MIEP_CH_1S_OFFS_CNT_INIT_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;     /**< \brief [1:0] Bits [1:0] are set to “00” (word aligned value). - FIXED_TO_00 (r) */
    Ifx_Strict_32Bit EP_OFFS_CNT_INIT:22;    /**< \brief [23:2] Extra Path Offset Counter Init - EP_OFFS_CNT_INIT (rw) */
    Ifx_Strict_32Bit reserved_24:8;     /**< \brief [31:24] \internal Reserved */
} Ifx_CIF_MIEP_CH_1S_OFFS_CNT_INIT_Bits;

/** \brief Memory Interface Current Offset Counter of Extra Path ${j} Buffer Register */
typedef struct _Ifx_CIF_MIEP_CH_1S_OFFS_CNT_SHD_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;     /**< \brief [1:0] Bits [1:0] are set to “00” (word aligned value). - FIXED_TO_00 (r) */
    Ifx_Strict_32Bit EP_OFFS_CNT:22;    /**< \brief [23:2] Extra Path Y Offset Counter - EP_OFFS_CNT (r) */
    Ifx_Strict_32Bit reserved_24:8;     /**< \brief [31:24] \internal Reserved */
} Ifx_CIF_MIEP_CH_1S_OFFS_CNT_SHD_Bits;

/** \brief Memory Interface Offset Counter Start Value for Extra Path ${j} Register */
typedef struct _Ifx_CIF_MIEP_CH_1S_OFFS_CNT_START_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;     /**< \brief [1:0] Bits [1:0] are set to “00” (word aligned value). - FIXED_TO_00 (r) */
    Ifx_Strict_32Bit EP_OFFS_CNT_START:22;    /**< \brief [23:2] Extra Path Offset Counter Start - EP_OFFS_CNT_START (r) */
    Ifx_Strict_32Bit reserved_24:8;     /**< \brief [31:24] \internal Reserved */
} Ifx_CIF_MIEP_CH_1S_OFFS_CNT_START_Bits;

/** \brief Memory Interface Size of Extra Path ${j} Data Buffer Register */
typedef struct _Ifx_CIF_MIEP_CH_1S_SIZE_INIT_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;     /**< \brief [1:0] Bits [1:0] are set to “00” (word aligned value). - FIXED_TO_00 (r) */
    Ifx_Strict_32Bit EP_SIZE_INIT:22;    /**< \brief [23:2] Extra Path Size Init - EP_SIZE_INIT (rw) */
    Ifx_Strict_32Bit reserved_24:8;     /**< \brief [31:24] \internal Reserved */
} Ifx_CIF_MIEP_CH_1S_SIZE_INIT_Bits;

/** \brief Memory Interface Size Shadow Register of Extra Path ${j} Buffer Register */
typedef struct _Ifx_CIF_MIEP_CH_1S_SIZE_SHD_Bits
{
    Ifx_Strict_32Bit FIXED_TO_00:2;     /**< \brief [1:0] Bits [1:0] are set to “00” (word aligned value). - FIXED_TO_00 (r) */
    Ifx_Strict_32Bit EP_SIZE:22;        /**< \brief [23:2] Extra Path Size - EP_SIZE (r) */
    Ifx_Strict_32Bit reserved_24:8;     /**< \brief [31:24] \internal Reserved */
} Ifx_CIF_MIEP_CH_1S_SIZE_SHD_Bits;

/** \brief MI Extra Path Interrupt Clear Register */
typedef struct _Ifx_CIF_MIEP_ICR_Bits
{
    Ifx_Strict_32Bit FRAME_END_EP_1:1;    /**< \brief [0:0] Extra Path 1 Frame End - FRAME_END_EP_1 (w) */
    Ifx_Strict_32Bit FILL_EP_1:1;       /**< \brief [1:1] Fill Extra Path 1 - FILL_EP_1 (w) */
    Ifx_Strict_32Bit WRAP_EP_1:1;       /**< \brief [2:2] Wrap Extra Path 1 - WRAP_EP_1 (w) */
    Ifx_Strict_32Bit MBLK_LINE_EP_1:1;    /**< \brief [3:3] Macro Block Line Interrupt Extra Path 1 - MBLK_LINE_EP_1 (w) */
    Ifx_Strict_32Bit FRAME_END_EP_2:1;    /**< \brief [4:4] Extra Path 2 Frame End - FRAME_END_EP_2 (w) */
    Ifx_Strict_32Bit FILL_EP_2:1;       /**< \brief [5:5] Fill Extra Path 2 - FILL_EP_2 (w) */
    Ifx_Strict_32Bit WRAP_EP_2:1;       /**< \brief [6:6] Wrap Extra Path 2 - WRAP_EP_2 (w) */
    Ifx_Strict_32Bit reserved_7:1;      /**< \brief [7:7] \internal Reserved */
    Ifx_Strict_32Bit FRAME_END_EP_3:1;    /**< \brief [8:8] Extra Path 3 Frame End - FRAME_END_EP_3 (w) */
    Ifx_Strict_32Bit FILL_EP_3:1;       /**< \brief [9:9] Fill Extra Path 3 - FILL_EP_3 (w) */
    Ifx_Strict_32Bit WRAP_EP_3:1;       /**< \brief [10:10] Wrap Extra Path 3 - WRAP_EP_3 (w) */
    Ifx_Strict_32Bit MBLK_LINE_EP_3:1;    /**< \brief [11:11] Macro Block Line Interrupt Extra Path 3 - MBLK_LINE_EP_3 (w) */
    Ifx_Strict_32Bit FRAME_END_EP_4:1;    /**< \brief [12:12] Extra Path 4 Frame End - FRAME_END_EP_4 (w) */
    Ifx_Strict_32Bit FILL_EP_4:1;       /**< \brief [13:13] Fill Extra Path 4 - FILL_EP_4 (w) */
    Ifx_Strict_32Bit WRAP_EP_4:1;       /**< \brief [14:14] Wrap Extra Path 4 - WRAP_EP_4 (w) */
    Ifx_Strict_32Bit MBLK_LINE_EP_4:1;    /**< \brief [15:15] Macro Block Line Interrupt Extra Path 4 - MBLK_LINE_EP_4 (w) */
    Ifx_Strict_32Bit FRAME_END_EP_5:1;    /**< \brief [16:16] Extra Path 5 Frame End - FRAME_END_EP_5 (w) */
    Ifx_Strict_32Bit FILL_EP_5:1;       /**< \brief [17:17] Fill Extra Path 5 - FILL_EP_5 (w) */
    Ifx_Strict_32Bit WRAP_EP_5:1;       /**< \brief [18:18] Wrap Extra Path 5 - WRAP_EP_5 (w) */
    Ifx_Strict_32Bit MBLK_LINE_EP_5:1;    /**< \brief [19:19] Macro Block Line Interrupt Extra Path 5 - MBLK_LINE_EP_5 (w) */
    Ifx_Strict_32Bit reserved_20:12;    /**< \brief [31:20] \internal Reserved */
} Ifx_CIF_MIEP_ICR_Bits;

