Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCif_regdef.h
/** \brief MI Extra Path Interrupt Mask ‘1’: interrupt active, ‘0’: interrupt masked */
typedef struct _Ifx_CIF_MIEP_IMSC_Bits
{
    Ifx_Strict_32Bit FRAME_END_EP_1:1;    /**< \brief [0:0] Extra Path 1 Frame End - FRAME_END_EP_1 (rw) */
    Ifx_Strict_32Bit FILL_EP_1:1;       /**< \brief [1:1] Fill Extra Path 1 - FILL_EP_1 (rw) */
    Ifx_Strict_32Bit WRAP_EP_1:1;       /**< \brief [2:2] Wrap Extra Path 1 - WRAP_EP_1 (rw) */
    Ifx_Strict_32Bit MBLK_LINE_EP_1:1;    /**< \brief [3:3] Macro Block Line Interrupt Extra Path 1 - MBLK_LINE_EP_1 (rw) */
    Ifx_Strict_32Bit FRAME_END_EP_2:1;    /**< \brief [4:4] Extra Path 2 Frame End - FRAME_END_EP_2 (rw) */
    Ifx_Strict_32Bit FILL_EP_2:1;       /**< \brief [5:5] Fill Extra Path 2 - FILL_EP_2 (rw) */
    Ifx_Strict_32Bit WRAP_EP_2:1;       /**< \brief [6:6] Wrap Extra Path 2 - WRAP_EP_2 (rw) */
    Ifx_Strict_32Bit MBLK_LINE_EP_2:1;    /**< \brief [7:7] Macro Block Line Interrupt Extra Path 2 - MBLK_LINE_EP_2 (rw) */
    Ifx_Strict_32Bit FRAME_END_EP_3:1;    /**< \brief [8:8] Extra Path 3 Frame End - FRAME_END_EP_3 (rw) */
    Ifx_Strict_32Bit FILL_EP_3:1;       /**< \brief [9:9] Fill Extra Path 3 - FILL_EP_3 (rw) */
    Ifx_Strict_32Bit WRAP_EP_3:1;       /**< \brief [10:10] Wrap Extra Path 3 - WRAP_EP_3 (rw) */
    Ifx_Strict_32Bit MBLK_LINE_EP_3:1;    /**< \brief [11:11] Macro Block Line Interrupt Extra Path 3 - MBLK_LINE_EP_3 (rw) */
    Ifx_Strict_32Bit FRAME_END_EP_4:1;    /**< \brief [12:12] Extra Path 4 Frame End - FRAME_END_EP_4 (rw) */
    Ifx_Strict_32Bit FILL_EP_4:1;       /**< \brief [13:13] Fill Extra Path 4 - FILL_EP_4 (rw) */
    Ifx_Strict_32Bit WRAP_EP_4:1;       /**< \brief [14:14] Wrap Extra Path 4 - WRAP_EP_4 (rw) */
    Ifx_Strict_32Bit MBLK_LINE_EP_4:1;    /**< \brief [15:15] Macro Block Line Interrupt Extra Path 4 - MBLK_LINE_EP_4 (rw) */
    Ifx_Strict_32Bit FRAME_END_EP_5:1;    /**< \brief [16:16] Extra Path 5 Frame End - FRAME_END_EP_5 (rw) */
    Ifx_Strict_32Bit FILL_EP_5:1;       /**< \brief [17:17] Fill Extra Path 5 - FILL_EP_5 (rw) */
    Ifx_Strict_32Bit WRAP_EP_5:1;       /**< \brief [18:18] Wrap Extra Path 5 - WRAP_EP_5 (rw) */
    Ifx_Strict_32Bit MBLK_LINE_EP_5:1;    /**< \brief [19:19] Macro Block Line Interrupt Extra Path 5 - MBLK_LINE_EP_5 (rw) */
    Ifx_Strict_32Bit reserved_20:12;    /**< \brief [31:20] \internal Reserved */
} Ifx_CIF_MIEP_IMSC_Bits;

/** \brief MI Extra Path Interrupt Set Register */
typedef struct _Ifx_CIF_MIEP_ISR_Bits
{
    Ifx_Strict_32Bit FRAME_END_EP_1:1;    /**< \brief [0:0] Extra Path 1 Frame End - FRAME_END_EP_1 (w) */
    Ifx_Strict_32Bit FILL_EP_1:1;       /**< \brief [1:1] Fill Extra Path 1 - FILL_EP_1 (w) */
    Ifx_Strict_32Bit WRAP_EP_1:1;       /**< \brief [2:2] Wrap Extra Path 1 - WRAP_EP_1 (w) */
    Ifx_Strict_32Bit MBLK_LINE_EP_1:1;    /**< \brief [3:3] Macro Block Line Interrupt Extra Path 1 - MBLK_LINE_EP_1 (w) */
    Ifx_Strict_32Bit FRAME_END_EP_2:1;    /**< \brief [4:4] Extra Path 2 Frame End - FRAME_END_EP_2 (w) */
    Ifx_Strict_32Bit FILL_EP_2:1;       /**< \brief [5:5] Fill Extra Path 2 - FILL_EP_2 (w) */
    Ifx_Strict_32Bit WRAP_EP_2:1;       /**< \brief [6:6] Wrap Extra Path 2 - WRAP_EP_2 (w) */
    Ifx_Strict_32Bit MBLK_LINE_EP_2:1;    /**< \brief [7:7] Macro Block Line Interrupt Extra Path 2 - MBLK_LINE_EP_2 (w) */
    Ifx_Strict_32Bit FRAME_END_EP_3:1;    /**< \brief [8:8] Extra Path 3 Frame End - FRAME_END_EP_3 (w) */
    Ifx_Strict_32Bit FILL_EP_3:1;       /**< \brief [9:9] Fill Extra Path 3 - FILL_EP_3 (w) */
    Ifx_Strict_32Bit WRAP_EP_3:1;       /**< \brief [10:10] Wrap Extra Path 3 - WRAP_EP_3 (w) */
    Ifx_Strict_32Bit MBLK_LINE_EP_3:1;    /**< \brief [11:11] Macro Block Line Interrupt Extra Path 3 - MBLK_LINE_EP_3 (w) */
    Ifx_Strict_32Bit FRAME_END_EP_4:1;    /**< \brief [12:12] Extra Path 4 Frame End - FRAME_END_EP_4 (w) */
    Ifx_Strict_32Bit FILL_EP_4:1;       /**< \brief [13:13] Fill Extra Path 4 - FILL_EP_4 (w) */
    Ifx_Strict_32Bit WRAP_EP_4:1;       /**< \brief [14:14] Wrap Extra Path 4 - WRAP_EP_4 (w) */
    Ifx_Strict_32Bit MBLK_LINE_EP_4:1;    /**< \brief [15:15] Macro Block Line Interrupt Extra Path 4 - MBLK_LINE_EP_4 (w) */
    Ifx_Strict_32Bit FRAME_END_EP_5:1;    /**< \brief [16:16] Extra Path 5 Frame End - FRAME_END_EP_5 (w) */
    Ifx_Strict_32Bit FILL_EP_5:1;       /**< \brief [17:17] Fill Extra Path 5 - FILL_EP_5 (w) */
    Ifx_Strict_32Bit WRAP_EP_5:1;       /**< \brief [18:18] Wrap Extra Path 5 - WRAP_EP_5 (w) */
    Ifx_Strict_32Bit MBLK_LINE_EP_5:1;    /**< \brief [19:19] Macro Block Line Interrupt Extra Path 5 - MBLK_LINE_EP_5 (w) */
    Ifx_Strict_32Bit reserved_20:12;    /**< \brief [31:20] \internal Reserved */
} Ifx_CIF_MIEP_ISR_Bits;

/** \brief MI Extra Path Masked Interrupt Status Register */
typedef struct _Ifx_CIF_MIEP_MIS_Bits
{
    Ifx_Strict_32Bit FRAME_END_EP_1:1;    /**< \brief [0:0] Extra Path 1 Frame End - FRAME_END_EP_1 (r) */
    Ifx_Strict_32Bit FILL_EP_1:1;       /**< \brief [1:1] Fill Extra Path 1 - FILL_EP_1 (r) */
    Ifx_Strict_32Bit WRAP_EP_1:1;       /**< \brief [2:2] Wrap Extra Path 1 - WRAP_EP_1 (r) */
    Ifx_Strict_32Bit MBLK_LINE_EP_1:1;    /**< \brief [3:3] Macro Block Line Interrupt Extra Path 1 - MBLK_LINE_EP_1 (r) */
    Ifx_Strict_32Bit FRAME_END_EP_2:1;    /**< \brief [4:4] Extra Path 2 Frame End - FRAME_END_EP_2 (r) */
    Ifx_Strict_32Bit FILL_EP_2:1;       /**< \brief [5:5] Fill Extra Path 2 - FILL_EP_2 (r) */
    Ifx_Strict_32Bit WRAP_EP_2:1;       /**< \brief [6:6] Wrap Extra Path 2 - WRAP_EP_2 (r) */
    Ifx_Strict_32Bit MBLK_LINE_EP_2:1;    /**< \brief [7:7] Macro Block Line Interrupt Extra Path 2 - MBLK_LINE_EP_2 (r) */
    Ifx_Strict_32Bit FRAME_END_EP_3:1;    /**< \brief [8:8] Extra Path 3 Frame End - FRAME_END_EP_3 (r) */
    Ifx_Strict_32Bit FILL_EP_3:1;       /**< \brief [9:9] Fill Extra Path 3 - FILL_EP_3 (r) */
    Ifx_Strict_32Bit WRAP_EP_3:1;       /**< \brief [10:10] Wrap Extra Path 3 - WRAP_EP_3 (r) */
    Ifx_Strict_32Bit MBLK_LINE_EP_3:1;    /**< \brief [11:11] Macro Block Line Interrupt Extra Path 3 - MBLK_LINE_EP_3 (r) */
    Ifx_Strict_32Bit FRAME_END_EP_4:1;    /**< \brief [12:12] Extra Path 4 Frame End - FRAME_END_EP_4 (r) */
    Ifx_Strict_32Bit FILL_EP_4:1;       /**< \brief [13:13] Fill Extra Path 4 - FILL_EP_4 (r) */
    Ifx_Strict_32Bit WRAP_EP_4:1;       /**< \brief [14:14] Wrap Extra Path 4 - WRAP_EP_4 (r) */
    Ifx_Strict_32Bit MBLK_LINE_EP_4:1;    /**< \brief [15:15] Macro Block Line Interrupt Extra Path 4 - MBLK_LINE_EP_4 (r) */
    Ifx_Strict_32Bit FRAME_END_EP_5:1;    /**< \brief [16:16] Extra Path 5 Frame End - FRAME_END_EP_5 (r) */
    Ifx_Strict_32Bit FILL_EP_5:1;       /**< \brief [17:17] Fill Extra Path 5 - FILL_EP_5 (r) */
    Ifx_Strict_32Bit WRAP_EP_5:1;       /**< \brief [18:18] Wrap Extra Path 5 - WRAP_EP_5 (r) */
    Ifx_Strict_32Bit MBLK_LINE_EP_5:1;    /**< \brief [19:19] Macro Block Line Interrupt Extra Path 5 - MBLK_LINE_EP_5 (r) */
    Ifx_Strict_32Bit reserved_20:12;    /**< \brief [31:20] \internal Reserved */
} Ifx_CIF_MIEP_MIS_Bits;

