Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCif_regdef.h
/** \brief Watchdog Interrupt Clear Register */
typedef struct _Ifx_CIF_WD_ICR_Bits
{
    Ifx_Strict_32Bit ICR_WD_HSE_TO:1;    /**< \brief [0:0] Horizontal Start End Timeout - ICR_WD_HSE_TO (w) */
    Ifx_Strict_32Bit ICR_WD_HES_TO:1;    /**< \brief [1:1] Horizontal End Start Timeout - ICR_WD_HES_TO (w) */
    Ifx_Strict_32Bit ICR_WD_VSE_TO:1;    /**< \brief [2:2] Vertical Start End Timeout - ICR_WD_VSE_TO (w) */
    Ifx_Strict_32Bit ICR_WD_VES_TO:1;    /**< \brief [3:3] Vertical End Start Timeout - ICR_WD_VES_TO (w) */
    Ifx_Strict_32Bit reserved_4:28;     /**< \brief [31:4] \internal Reserved */
} Ifx_CIF_WD_ICR_Bits;

/** \brief Watchdog Interrupt Mask Register */
typedef struct _Ifx_CIF_WD_IMSC_Bits
{
    Ifx_Strict_32Bit IMSC_WD_HSE_TO:1;    /**< \brief [0:0] Horizontal Start End Timeout - IMSC_WD_HSE_TO (rw) */
    Ifx_Strict_32Bit IMSC_WD_HES_TO:1;    /**< \brief [1:1] Horizontal End Start Timeout - IMSC_WD_HES_TO (rw) */
    Ifx_Strict_32Bit IMSC_WD_VSE_TO:1;    /**< \brief [2:2] Vertical Start End Timeout - IMSC_WD_VSE_TO (rw) */
    Ifx_Strict_32Bit IMSC_WD_VES_TO:1;    /**< \brief [3:3] Vertical End Start Timeout - IMSC_WD_VES_TO (rw) */
    Ifx_Strict_32Bit reserved_4:28;     /**< \brief [31:4] \internal Reserved */
} Ifx_CIF_WD_IMSC_Bits;

/** \brief Watchdog Interrupt Set Register */
typedef struct _Ifx_CIF_WD_ISR_Bits
{
    Ifx_Strict_32Bit ISR_WD_HSE_TO:1;    /**< \brief [0:0] Horizontal Start End Timeout - ISR_WD_HSE_TO (w) */
    Ifx_Strict_32Bit ISR_WD_HES_TO:1;    /**< \brief [1:1] Horizontal End Start Timeout - ISR_WD_HES_TO (w) */
    Ifx_Strict_32Bit ISR_WD_VSE_TO:1;    /**< \brief [2:2] Vertical Start End Timeout - ISR_WD_VSE_TO (w) */
    Ifx_Strict_32Bit ISR_WD_VES_TO:1;    /**< \brief [3:3] Vertical End Start Timeout - ISR_WD_VES_TO (w) */
    Ifx_Strict_32Bit reserved_4:28;     /**< \brief [31:4] \internal Reserved */
} Ifx_CIF_WD_ISR_Bits;

/** \brief Watchdog Masked Interrupt Status Register */
typedef struct _Ifx_CIF_WD_MIS_Bits
{
    Ifx_Strict_32Bit MIS_WD_HSE_TO:1;    /**< \brief [0:0] Horizontal Start End Timeout - MIS_WD_HSE_TO (r) */
    Ifx_Strict_32Bit MIS_WD_HES_TO:1;    /**< \brief [1:1] Horizontal End Start Timeout - MIS_WD_HES_TO (r) */
    Ifx_Strict_32Bit MIS_WD_VSE_TO:1;    /**< \brief [2:2] Vertical Start End Timeout - MIS_WD_VSE_TO (r) */
    Ifx_Strict_32Bit MIS_WD_VES_TO:1;    /**< \brief [3:3] Vertical End Start Timeout - MIS_WD_VES_TO (r) */
    Ifx_Strict_32Bit reserved_4:28;     /**< \brief [31:4] \internal Reserved */
} Ifx_CIF_WD_MIS_Bits;

/** \brief Watchdog Raw Interrupt Status Register */
typedef struct _Ifx_CIF_WD_RIS_Bits
{
    Ifx_Strict_32Bit RIS_WD_HSE_TO:1;    /**< \brief [0:0] Horizontal Start End Timeout - RIS_WD_HSE_TO (r) */
    Ifx_Strict_32Bit RIS_WD_HES_TO:1;    /**< \brief [1:1] Horizontal End Start Timeout - RIS_WD_HES_TO (r) */
    Ifx_Strict_32Bit RIS_WD_VSE_TO:1;    /**< \brief [2:2] Vertical Start End Timeout - RIS_WD_VSE_TO (r) */
    Ifx_Strict_32Bit RIS_WD_VES_TO:1;    /**< \brief [3:3] Vertical End Start Timeout - RIS_WD_VES_TO (r) */
    Ifx_Strict_32Bit reserved_4:28;     /**< \brief [31:4] \internal Reserved */
} Ifx_CIF_WD_RIS_Bits;

/** \brief Watchdog Vertical Timeout Register */
typedef struct _Ifx_CIF_WD_V_TIMEOUT_Bits
{
    Ifx_Strict_32Bit WD_VSE_TO:16;      /**< \brief [15:0] Watchdog Vertical Start End Timeout - WD_VSE_TO (rw) */
    Ifx_Strict_32Bit WD_VES_TO:16;      /**< \brief [31:16] Watchdog Vertical End Start Timeout - WD_VES_TO (rw) */
} Ifx_CIF_WD_V_TIMEOUT_Bits;

/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_cif_union
 * \{   */
/** \brief Access Enable Register 0   */
typedef union
{
    unsigned int            U;              /**< \brief Unsigned access */
    signed int              I;              /**< \brief Signed access */
    Ifx_CIF_BBB_ACCEN0_Bits B;        /**< \brief Bitfield access */
} Ifx_CIF_BBB_ACCEN0;

/** \brief Access Enable Register 1   */
typedef union
{
    unsigned int            U;              /**< \brief Unsigned access */
    signed int              I;              /**< \brief Signed access */
    Ifx_CIF_BBB_ACCEN1_Bits B;        /**< \brief Bitfield access */
} Ifx_CIF_BBB_ACCEN1;

/** \brief Clock Control Register   */
typedef union
{
    unsigned int         U;                 /**< \brief Unsigned access */
    signed int           I;                 /**< \brief Signed access */
    Ifx_CIF_BBB_CLC_Bits B;           /**< \brief Bitfield access */
} Ifx_CIF_BBB_CLC;

/** \brief General Purpose Control Register   */
typedef union
{
    unsigned int           U;               /**< \brief Unsigned access */
    signed int             I;               /**< \brief Signed access */
    Ifx_CIF_BBB_GPCTL_Bits B;         /**< \brief Bitfield access */
} Ifx_CIF_BBB_GPCTL;

/** \brief Kernel Reset Register 0   */
typedef union
{
    unsigned int           U;               /**< \brief Unsigned access */
    signed int             I;               /**< \brief Signed access */
    Ifx_CIF_BBB_KRST0_Bits B;         /**< \brief Bitfield access */
} Ifx_CIF_BBB_KRST0;

/** \brief Kernel Reset Register 1   */
typedef union
{
    unsigned int           U;               /**< \brief Unsigned access */
    signed int             I;               /**< \brief Signed access */
    Ifx_CIF_BBB_KRST1_Bits B;         /**< \brief Bitfield access */
} Ifx_CIF_BBB_KRST1;

/** \brief Kernel Reset Status Clear Register   */
typedef union
{
    unsigned int             U;             /**< \brief Unsigned access */
    signed int               I;             /**< \brief Signed access */
    Ifx_CIF_BBB_KRSTCLR_Bits B;       /**< \brief Bitfield access */
} Ifx_CIF_BBB_KRSTCLR;

/** \brief Module Identification Register   */
typedef union
{
    unsigned int           U;               /**< \brief Unsigned access */
    signed int             I;               /**< \brief Signed access */
    Ifx_CIF_BBB_MODID_Bits B;         /**< \brief Bitfield access */
} Ifx_CIF_BBB_MODID;

/** \brief Clock Control Register   */
typedef union
{
    unsigned int     U;                     /**< \brief Unsigned access */
    signed int       I;                     /**< \brief Signed access */
    Ifx_CIF_CCL_Bits B;               /**< \brief Bitfield access */
} Ifx_CIF_CCL;

/** \brief CIF Data Path Control Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_DPCL_Bits B;              /**< \brief Bitfield access */
} Ifx_CIF_DPCL;

/** \brief Debug Path Control Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int           I;                 /**< \brief Signed access */
    Ifx_CIF_DP_CTRL_Bits B;           /**< \brief Bitfield access */
} Ifx_CIF_DP_CTRL;

/** \brief Debug Path Frame/Line Counter Status Register   */
typedef union
{
    unsigned int             U;             /**< \brief Unsigned access */
    signed int               I;             /**< \brief Signed access */
    Ifx_CIF_DP_FLC_STAT_Bits B;       /**< \brief Bitfield access */
} Ifx_CIF_DP_FLC_STAT;

/** \brief Debug Path Predivider Control Register   */
typedef union
{
    unsigned int              U;            /**< \brief Unsigned access */
    signed int                I;            /**< \brief Signed access */
    Ifx_CIF_DP_PDIV_CTRL_Bits B;      /**< \brief Bitfield access */
} Ifx_CIF_DP_PDIV_CTRL;

/** \brief Debug Path Predivider Counter Status Register   */
typedef union
{
    unsigned int              U;            /**< \brief Unsigned access */
    signed int                I;            /**< \brief Signed access */
    Ifx_CIF_DP_PDIV_STAT_Bits B;      /**< \brief Bitfield access */
} Ifx_CIF_DP_PDIV_STAT;

/** \brief Debug Path Timestamp Counter Status Register   */
typedef union
{
    unsigned int             U;             /**< \brief Unsigned access */
    signed int               I;             /**< \brief Signed access */
    Ifx_CIF_DP_TSC_STAT_Bits B;       /**< \brief Bitfield access */
} Ifx_CIF_DP_TSC_STAT;

/** \brief Debug Path User Defined Symbol ${x} Register   */
typedef union
{
    unsigned int        U;                  /**< \brief Unsigned access */
    signed int          I;                  /**< \brief Signed access */
    Ifx_CIF_DP_UDS_1S_Bits B;         /**< \brief Bitfield access */
} Ifx_CIF_DP_UDS_1S;

