Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCif_regdef.h
/** \brief Extra Path ${i} Image Cropping Control Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_EP_IC_1S_CTRL_Bits B;     /**< \brief Bitfield access */
} Ifx_CIF_EP_IC_1S_CTRL;

/** \brief Extra Path ${i} Image Cropping Camera Displacement Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_EP_IC_1S_DISPLACE_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_EP_IC_1S_DISPLACE;

/** \brief Extra Path ${i} Image Cropping Horizontal Offset of Output Window Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_EP_IC_1S_H_OFFS_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_EP_IC_1S_H_OFFS;

/** \brief Extra Path ${i} Image Cropping Current Horizontal Offset of Output Window Shadow Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_EP_IC_1S_H_OFFS_SHD_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_EP_IC_1S_H_OFFS_SHD;

/** \brief Extra Path ${i} Image Cropping Output Horizontal Picture Size Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_EP_IC_1S_H_SIZE_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_EP_IC_1S_H_SIZE;

/** \brief Extra Path ${i} Image Cropping Current Output Horizontal Picture Size Shadow Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_EP_IC_1S_H_SIZE_SHD_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_EP_IC_1S_H_SIZE_SHD;

/** \brief Extra Path ${i} Image Cropping Maximum Horizontal Displacement Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_EP_IC_1S_MAX_DX_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_EP_IC_1S_MAX_DX;

/** \brief Extra Path ${i} Image Cropping Maximum Vertical Displacement Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_EP_IC_1S_MAX_DY_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_EP_IC_1S_MAX_DY;

/** \brief Extra Path ${i} Image Cropping Recenter Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_EP_IC_1S_RECENTER_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_EP_IC_1S_RECENTER;

/** \brief Extra Path ${i} Image Cropping Vertical Offset Of Output Window Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_EP_IC_1S_V_OFFS_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_EP_IC_1S_V_OFFS;

/** \brief Extra Path ${i} Image Cropping Current Vertical Offset Of Output Window Shadow Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_EP_IC_1S_V_OFFS_SHD_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_EP_IC_1S_V_OFFS_SHD;

/** \brief Extra Path ${i} Image Cropping Output Vertical Picture Size Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_EP_IC_1S_V_SIZE_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_EP_IC_1S_V_SIZE;

/** \brief Extra Path ${i} Image Cropping Current Output Vertical Picture Size Shadow Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_EP_IC_1S_V_SIZE_SHD_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_EP_IC_1S_V_SIZE_SHD;

/** \brief CIF Internal Clock Control Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_ICCL_Bits B;              /**< \brief Bitfield access */
} Ifx_CIF_ICCL;

/** \brief CIF Revision Identification Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_ID_Bits B;                /**< \brief Bitfield access */
} Ifx_CIF_ID;

/** \brief CIF Internal Reset Control Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_IRCL_Bits B;              /**< \brief Bitfield access */
} Ifx_CIF_IRCL;

/** \brief ISP Image Stabilization Control Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_ISPIS_CTRL_Bits B;        /**< \brief Bitfield access */
} Ifx_CIF_ISPIS_CTRL;

/** \brief ISP Image Stabilization Camera Displacement Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_ISPIS_DISPLACE_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_ISPIS_DISPLACE;

/** \brief ISP Image Stabilization Horizontal Offset Of Output Window Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_ISPIS_H_OFFS_Bits B;      /**< \brief Bitfield access */
} Ifx_CIF_ISPIS_H_OFFS;

/** \brief ISP Image Current Horizontal Offset Of Output Window Shadow Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_ISPIS_H_OFFS_SHD_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_ISPIS_H_OFFS_SHD;

/** \brief ISP Image Stabilization Output Horizontal Picture Size Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_ISPIS_H_SIZE_Bits B;      /**< \brief Bitfield access */
} Ifx_CIF_ISPIS_H_SIZE;

/** \brief ISP Image Current Output Horizontal Picture Size Shadow Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_ISPIS_H_SIZE_SHD_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_ISPIS_H_SIZE_SHD;

/** \brief ISP Image Stabilization Maximum Horizontal Displacement Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_ISPIS_MAX_DX_Bits B;      /**< \brief Bitfield access */
} Ifx_CIF_ISPIS_MAX_DX;

/** \brief ISP Image Stabilization Maximum Vertical Displacement Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_ISPIS_MAX_DY_Bits B;      /**< \brief Bitfield access */
} Ifx_CIF_ISPIS_MAX_DY;

/** \brief ISP Image Stabilization Recenter Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_ISPIS_RECENTER_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_ISPIS_RECENTER;

/** \brief ISP Image Stabilization Vertical Offset Of Output Window Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_ISPIS_V_OFFS_Bits B;      /**< \brief Bitfield access */
} Ifx_CIF_ISPIS_V_OFFS;

/** \brief ISP Image Current Vertical Offset Of Output Window Shadow Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_ISPIS_V_OFFS_SHD_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_ISPIS_V_OFFS_SHD;

/** \brief ISP Image Stabilization Output Vertical Picture Size Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_ISPIS_V_SIZE_Bits B;      /**< \brief Bitfield access */
} Ifx_CIF_ISPIS_V_SIZE;

/** \brief ISP Image Current Output Vertical Picture Size Shadow Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_ISPIS_V_SIZE_SHD_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_ISPIS_V_SIZE_SHD;

