Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCif_regdef.h
/** \brief ISP Acquisition Horizontal Offset Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_ISP_ACQ_H_OFFS_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_ISP_ACQ_H_OFFS;

/** \brief ISP Acquisition Horizontal Size Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_ISP_ACQ_H_SIZE_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_ISP_ACQ_H_SIZE;

/** \brief ISP Acquisition Number of Frames Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_ISP_ACQ_NR_FRAMES_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_ISP_ACQ_NR_FRAMES;

/** \brief ISP Acquisition Properties Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_ISP_ACQ_PROP_Bits B;      /**< \brief Bitfield access */
} Ifx_CIF_ISP_ACQ_PROP;

/** \brief ISP Acquistion Vertical Offset Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_ISP_ACQ_V_OFFS_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_ISP_ACQ_V_OFFS;

/** \brief ISP Acquisition Vertical Size Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_ISP_ACQ_V_SIZE_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_ISP_ACQ_V_SIZE;

/** \brief ISP Global Control Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_ISP_CTRL_Bits B;          /**< \brief Bitfield access */
} Ifx_CIF_ISP_CTRL;

/** \brief ISP Error Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_ISP_ERR_Bits B;           /**< \brief Bitfield access */
} Ifx_CIF_ISP_ERR;

/** \brief ISP Error Clear Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_ISP_ERR_CLR_Bits B;       /**< \brief Bitfield access */
} Ifx_CIF_ISP_ERR_CLR;

/** \brief ISP Shadow Flags Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_ISP_FLAGS_SHD_Bits B;     /**< \brief Bitfield access */
} Ifx_CIF_ISP_FLAGS_SHD;

/** \brief ISP Frame Counter Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_ISP_FRAME_COUNT_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_ISP_FRAME_COUNT;

/** \brief ISP Interrupt Clear Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_ISP_ICR_Bits B;           /**< \brief Bitfield access */
} Ifx_CIF_ISP_ICR;

/** \brief ISP Interrupt Mask Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_ISP_IMSC_Bits B;          /**< \brief Bitfield access */
} Ifx_CIF_ISP_IMSC;

/** \brief ISP Interrupt Set Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_ISP_ISR_Bits B;           /**< \brief Bitfield access */
} Ifx_CIF_ISP_ISR;

/** \brief ISP Masked Interrupt Status Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_ISP_MIS_Bits B;           /**< \brief Bitfield access */
} Ifx_CIF_ISP_MIS;

/** \brief ISP Output Window Horizontal Offset Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_ISP_OUT_H_OFFS_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_ISP_OUT_H_OFFS;

/** \brief ISP Output Window Horizontal Offset Shadow Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_ISP_OUT_H_OFFS_SHD_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_ISP_OUT_H_OFFS_SHD;

/** \brief ISP Output Horizontal Picture Size Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_ISP_OUT_H_SIZE_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_ISP_OUT_H_SIZE;

/** \brief ISP Output Horizontal Picture Size Shadow Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_ISP_OUT_H_SIZE_SHD_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_ISP_OUT_H_SIZE_SHD;

/** \brief ISP Output Window Vertical Offset Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_ISP_OUT_V_OFFS_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_ISP_OUT_V_OFFS;

/** \brief ISP Output Window Vertical Offset Shadow Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_ISP_OUT_V_OFFS_SHD_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_ISP_OUT_V_OFFS_SHD;

/** \brief ISP Output Vertical Picture Size Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_ISP_OUT_V_SIZE_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_ISP_OUT_V_SIZE;

