Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCif_regdef.h
/** \brief ISP Output Vertical Picture Size Shadow Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_ISP_OUT_V_SIZE_SHD_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_ISP_OUT_V_SIZE_SHD;

/** \brief ISP Raw Interrupt Status Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_ISP_RIS_Bits B;           /**< \brief Bitfield access */
} Ifx_CIF_ISP_RIS;

/** \brief JPE Huffman Table Selector For AC Values Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_JPE_AC_TABLE_SELECT_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_JPE_AC_TABLE_SELECT;

/** \brief JPE Cb/Cr Value Scaling Control Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_JPE_CBCR_SCALE_EN_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_JPE_CBCR_SCALE_EN;

/** \brief JPE Huffman Table Selector For DC Values Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_JPE_DC_TABLE_SELECT_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_JPE_DC_TABLE_SELECT;

/** \brief JPE Debug Information Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_JPE_DEBUG_Bits B;         /**< \brief Bitfield access */
} Ifx_CIF_JPE_DEBUG;

/** \brief JPE Start Command To Start JFIF Stream Encoding Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_JPE_ENCODE_Bits B;        /**< \brief Bitfield access */
} Ifx_CIF_JPE_ENCODE;

/** \brief JPE Encoder Status Flag Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_JPE_ENCODER_BUSY_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_JPE_ENCODER_BUSY;

/** \brief JPE Encode Mode Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_JPE_ENCODE_MODE_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_JPE_ENCODE_MODE;

/** \brief JPEG Codec Horizontal Image Size For Encoding Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_JPE_ENC_HSIZE_Bits B;     /**< \brief Bitfield access */
} Ifx_CIF_JPE_ENC_HSIZE;

/** \brief JPEG Codec Vertical Image Size For Encoding Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_JPE_ENC_VSIZE_Bits B;     /**< \brief Bitfield access */
} Ifx_CIF_JPE_ENC_VSIZE;

/** \brief JPE Error Interrupt Clear Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_JPE_ERROR_ICR_Bits B;     /**< \brief Bitfield access */
} Ifx_CIF_JPE_ERROR_ICR;

/** \brief JPE Error Interrupt Mask Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_JPE_ERROR_IMR_Bits B;     /**< \brief Bitfield access */
} Ifx_CIF_JPE_ERROR_IMR;

/** \brief JPE Error Interrupt Set Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_JPE_ERROR_ISR_Bits B;     /**< \brief Bitfield access */
} Ifx_CIF_JPE_ERROR_ISR;

/** \brief JPE Error Masked Interrupt Status Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_JPE_ERROR_MIS_Bits B;     /**< \brief Bitfield access */
} Ifx_CIF_JPE_ERROR_MIS;

/** \brief JPE Error Raw Interrupt Status Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_JPE_ERROR_RIS_Bits B;     /**< \brief Bitfield access */
} Ifx_CIF_JPE_ERROR_RIS;

/** \brief JPE Command To Start Stream Header Generation Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_JPE_GEN_HEADER_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_JPE_GEN_HEADER;

/** \brief JPE Header Mode Definition Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_JPE_HEADER_MODE_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_JPE_HEADER_MODE;

/** \brief JPE Automatic Configuration Update Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_JPE_INIT_Bits B;          /**< \brief Bitfield access */
} Ifx_CIF_JPE_INIT;

/** \brief JPEG Picture Encoding Format Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_JPE_PIC_FORMAT_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_JPE_PIC_FORMAT;

/** \brief JPE Restart Marker Insertion Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_JPE_RESTART_INTERVAL_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_JPE_RESTART_INTERVAL;

/** \brief JPEG Status Interrupt Clear Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_JPE_STATUS_ICR_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_JPE_STATUS_ICR;

/** \brief JPEG Status Interrupt Mask Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_JPE_STATUS_IMR_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_JPE_STATUS_IMR;

/** \brief JPEG Status Interrupt Set Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_JPE_STATUS_ISR_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_JPE_STATUS_ISR;

/** \brief JPEG Status Masked Interrupt Status Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_JPE_STATUS_MIS_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_JPE_STATUS_MIS;

