Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCif_regdef.h
/** \brief JPEG Status Raw Interrupt Status Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_JPE_STATUS_RIS_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_JPE_STATUS_RIS;

/** \brief JPE Table Programming Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_JPE_TABLE_DATA_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_JPE_TABLE_DATA;

/** \brief JPE Header Generation Debug Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_JPE_TABLE_FLUSH_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_JPE_TABLE_FLUSH;

/** \brief JPE Table Programming Select Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_JPE_TABLE_ID_Bits B;      /**< \brief Bitfield access */
} Ifx_CIF_JPE_TABLE_ID;

/** \brief JPE Huffman AC Table 0 Length Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_JPE_TAC0_LEN_Bits B;      /**< \brief Bitfield access */
} Ifx_CIF_JPE_TAC0_LEN;

/** \brief JPE Huffman AC Table 1 Length Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_JPE_TAC1_LEN_Bits B;      /**< \brief Bitfield access */
} Ifx_CIF_JPE_TAC1_LEN;

/** \brief JPE Huffman DC Table 0 Length Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_JPE_TDC0_LEN_Bits B;      /**< \brief Bitfield access */
} Ifx_CIF_JPE_TDC0_LEN;

/** \brief JPE Huffman DC Table 1 Length Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_JPE_TDC1_LEN_Bits B;      /**< \brief Bitfield access */
} Ifx_CIF_JPE_TDC1_LEN;

/** \brief Q- table Selector 1, Quant. Table For U Component   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_JPE_TQ_U_SELECT_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_JPE_TQ_U_SELECT;

/** \brief Q- table Selector 2 Quant Table For V Component   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_JPE_TQ_V_SELECT_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_JPE_TQ_V_SELECT;

/** \brief Q- table Selector 0, Quant. Table For Y Component   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_JPE_TQ_Y_SELECT_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_JPE_TQ_Y_SELECT;

/** \brief JPE Y Value Scaling Control Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_JPE_Y_SCALE_EN_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_JPE_Y_SCALE_EN;

/** \brief Linear Downscaler Control Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_LDS_CTRL_Bits B;          /**< \brief Bitfield access */
} Ifx_CIF_LDS_CTRL;

/** \brief Linear Downscaler Factor Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_LDS_FAC_Bits B;           /**< \brief Bitfield access */
} Ifx_CIF_LDS_FAC;

/** \brief Memory Interface Base Address for Extra Path ${j} Data Buffer Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_MIEP_CH_1S_BASE_AD_INIT_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_MIEP_CH_1S_BASE_AD_INIT;

/** \brief Memory Interface Base Address Shadow Register for Extra Path ${j} Buffer Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_MIEP_CH_1S_BASE_AD_SHD_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_MIEP_CH_1S_BASE_AD_SHD;

/** \brief Memory Interface Extra Path ${j} Control Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_MIEP_CH_1S_CTRL_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_MIEP_CH_1S_CTRL;

/** \brief Memory Interface Extra Path ${j} Control Internal Shadow Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_MIEP_CH_1S_CTRL_SHD_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_MIEP_CH_1S_CTRL_SHD;

/** \brief Memory Interface Extra Path ${j} Control Register For Address Init And Skip Function Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_MIEP_CH_1S_INIT_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_MIEP_CH_1S_INIT;

/** \brief Memory Interface Fill Level Interrupt Offset Value For Extra Path Data Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_MIEP_CH_1S_IRQ_OFFS_INIT_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_MIEP_CH_1S_IRQ_OFFS_INIT;

/** \brief Memory Interface Shadow Register of Fill Level Interrupt Offset Value For Extra Path ${j} Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_MIEP_CH_1S_IRQ_OFFS_SHD_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_MIEP_CH_1S_IRQ_OFFS_SHD;

/** \brief Memory Interface Offset Counter Init Value For Extra Path ${j} Buffer Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_MIEP_CH_1S_OFFS_CNT_INIT_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_MIEP_CH_1S_OFFS_CNT_INIT;

/** \brief Memory Interface Current Offset Counter of Extra Path ${j} Buffer Register   */
typedef union
{
    unsigned int U;                 /**< \brief Unsigned access */
    signed int I;                 /**< \brief Signed access */
    Ifx_CIF_MIEP_CH_1S_OFFS_CNT_SHD_Bits B;    /**< \brief Bitfield access */
} Ifx_CIF_MIEP_CH_1S_OFFS_CNT_SHD;

