Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxCif_regdef.h
/** \brief CIF object */
typedef volatile struct _Ifx_CIF
{
       Ifx_CIF_BBB                         BBB;                    /**< \brief 0, Kernel Reset Status Clear Register*/
       Ifx_UReg_8Bit                       reserved_20[224];       /**< \brief 20, \internal Reserved */
       Ifx_CIF_CCL                         CCL;                    /**< \brief 100, Clock Control Register*/
       Ifx_UReg_8Bit                       reserved_104[4];        /**< \brief 104, \internal Reserved */
       Ifx_CIF_ID                          ID;                     /**< \brief 108, CIF Revision Identification Register*/
       Ifx_UReg_8Bit                       reserved_10C[4];        /**< \brief 10C, \internal Reserved */
       Ifx_CIF_ICCL                        ICCL;                   /**< \brief 110, CIF Internal Clock Control Register*/
       Ifx_CIF_IRCL                        IRCL;                   /**< \brief 114, CIF Internal Reset Control Register*/
       Ifx_CIF_DPCL                        DPCL;                   /**< \brief 118, CIF Data Path Control Register*/
       Ifx_UReg_8Bit                       reserved_11C[996];      /**< \brief 11C, \internal Reserved */
       Ifx_CIF_ISP                         ISP;                    /**< \brief 500, */
       Ifx_UReg_8Bit                       reserved_748[3512];     /**< \brief 748, \internal Reserved */
       Ifx_CIF_MI                          MI;                     /**< \brief 1500, */
       Ifx_UReg_8Bit                       reserved_1614[748];     /**< \brief 1614, \internal Reserved */
       Ifx_CIF_JPE                         JPE;                    /**< \brief 1900, */
       Ifx_UReg_8Bit                       reserved_1990[2672];    /**< \brief 1990, \internal Reserved */
       Ifx_CIF_ISPIS                       ISPIS;                  /**< \brief 2400, ISP Image Current Output Vertical Picture Size Shadow Register*/
       Ifx_UReg_8Bit                       reserved_2434[204];     /**< \brief 2434, \internal Reserved */
       Ifx_CIF_WD                          WD;                     /**< \brief 2500, Watchdog Interrupt Set Register*/
       Ifx_UReg_8Bit                       reserved_2520[224];     /**< \brief 2520, \internal Reserved */
       Ifx_CIF_LDS                         LDS;                    /**< \brief 2600, Linear Downscaler Factor Register*/
       Ifx_UReg_8Bit                       reserved_2608[504];     /**< \brief 2608, \internal Reserved */
       Ifx_CIF_DP                          DP;                     /**< \brief 2800, */
       Ifx_UReg_8Bit                       reserved_2834[460];     /**< \brief 2834, \internal Reserved */
       Ifx_CIF_EP_IC_1S                    EP_IC_1S[5];            /**< \brief 2A00, */
       Ifx_UReg_8Bit                       reserved_2F00[1536];    /**< \brief 2F00, \internal Reserved */
       Ifx_CIF_MIEP                        MIEP;                   /**< \brief 3500, */
       Ifx_UReg_8Bit                       reserved_3B00[1];       /**< \brief 3B00, \internal Reserved */
} Ifx_CIF;

/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXCIF_REGDEF_H */
